#  Pandas Practice Notebook
This notebook helps you **practice Pandas concepts sequentially** - starting from basics and moving towards advanced data manipulation.

## 1Ô∏è‚É£ Creating Series and DataFrame
**Q1.** Create a Pandas **Series** containing 5 fruit names and print it.

In [1]:
# answer here
import pandas as pd
fruits = pd.Series(["apple", "banana", "orange", "grape", "kiwi"])
print(fruits)

0     apple
1    banana
2    orange
3     grape
4      kiwi
dtype: object

**Q2.** Create a Pandas **DataFrame** showing names and ages of 4 students.

In [4]:
# answer here
data = {
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Age": [25, 30, 22, 28]
}
df = pd.DataFrame(data)
print(df)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   22
3    David   28

## 2Ô∏è‚É£ Understanding head(), tail(), describe(), and shape
**Q1.** Use the DataFrame you created above and show the first 3 rows using `.head()`.

In [3]:
# answer here
data = {
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Age": [25, 30, 22, 28],
    "City": ["New York", "London", "Paris", "Tokyo"]
}
df = pd.DataFrame(data)
print(df.head(3))

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   22     Paris

**Q2.** Find the number of rows and columns using `.shape` and get summary statistics using `.describe()`.

In [5]:
# answer here
data = {
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Age": [25, 30, 22, 28]
}
df = pd.DataFrame(data)
print(df.shape)
print(df.describe())

(4, 2)
         Age
count   4.00
mean   26.25
std     3.50
min    22.00
25%    24.25
50%    26.50
75%    28.50
max    30.00

## 3Ô∏è‚É£ DataFrame Indexing and Selection
**Q1.** From a DataFrame `df`, select only the column `'Name'`.

In [6]:
# answer here
data = {
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Age": [25, 30, 22, 28]
}
df = pd.DataFrame(data)
print(df["Name"])

0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object

**Q2.** Select the first 3 rows and 2 columns using `.iloc`.

In [8]:
# answer here
data = {
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Age": [25, 30, 22, 28]
}
df = pd.DataFrame(data)
print(df.iloc[2])

Name    Charlie
Age          22
Name: 2, dtype: object

## 4Ô∏è‚É£ Filtering and Querying Data
**Q1.** Filter rows where `Age` is greater than 30.

In [9]:
# answer here
data = {
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Age": [25, 30, 22, 28]
}
df = pd.DataFrame(data)
print(df[df['Age']>30])

Empty DataFrame
Columns: [Name, Age]
Index: []

**Q2.** Using `.query()`, display rows where `City` equals `'Delhi'`.

In [10]:
# answer here
data = {
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Age": [25, 30, 22, 28],
    "City": ["New York", "London", "Paris", "Tokyo"]
}
df = pd.DataFrame(data)
print(df.query("City == 'New York'"))

    Name  Age      City
0  Alice   25  New York

## 5Ô∏è‚É£ Excel Data Cleaning ‚Äî Handling Missing or Merged Cells
**Q1.** Create a small DataFrame with some missing values and fill them using **forward fill (`ffill`)**.

In [11]:
# answer here
data = {
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Age": [25, 30, None, 28]
}
df = pd.DataFrame(data)
df['Age'].fillna(method='ffill', inplace=True)
print(df)

      Name   Age
0    Alice  25.0
1      Bob  30.0
2  Charlie  30.0
3    David  28.0

/tmp/ipython-input-3436822544.py:7: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(method='ffill', inplace=True)
/tmp/ipython-input-3436822544.py:7: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['Age'].fillna(method='ffill', inplace=True)

**Q2.** Replace all missing values with `'Unknown'` using `.fillna()`.

In [12]:
# answer here
data = {
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Age": [25, 30, None, 28]
}
df = pd.DataFrame(data)
df.fillna('Unknown', inplace=True)
print(df)

      Name      Age
0    Alice     25.0
1      Bob     30.0
2  Charlie  Unknown
3    David     28.0

/tmp/ipython-input-4005782910.py:7: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Unknown' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df.fillna('Unknown', inplace=True)

## 6Ô∏è‚É£ Data Type Conversions
**Q1.** Convert a column `'Age'` from integer to float.

In [13]:
# answer here
data = {
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Age": [25, 30, 22, 28]
}
df = pd.DataFrame(data)
df['Age'] = df['Age'].astype(float)
print(df)

      Name   Age
0    Alice  25.0
1      Bob  30.0
2  Charlie  22.0
3    David  28.0

**Q2.** Convert a column `'Date'` from string to datetime using `pd.to_datetime()`.

In [14]:
# answer here
data = {
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Date": ["2023-01-01", "2023-01-02", "2023-01-03", "2023-01-04"]
}
df = pd.DataFrame(data)
df['Date'] = pd.to_datetime(df['Date'])
print(df)

      Name       Date
0    Alice 2023-01-01
1      Bob 2023-01-02
2  Charlie 2023-01-03
3    David 2023-01-04

## 7Ô∏è‚É£ Basic Data Manipulation (rename, drop, fillna)
**Q1.** Rename a column `'City'` to `'Location'`.

In [15]:
# answer here
data = {
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Age": [25, 30, 22, 28],
    "City": ["New York", "London", "Paris", "Tokyo"]
}
df = pd.DataFrame(data)
df.rename(columns={'City': 'Location'}, inplace=True)
print(df)

      Name  Age  Location
0    Alice   25  New York
1      Bob   30    London
2  Charlie   22     Paris
3    David   28     Tokyo

**Q2.** Drop the `'Age'` column from the DataFrame.

In [16]:
# answer here
data = {
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Age": [25, 30, 22, 28],
    "City": ["New York", "London", "Paris", "Tokyo"]
}
df = pd.DataFrame(data)
df.drop('Age', axis=1, inplace=True)
print(df)

      Name      City
0    Alice  New York
1      Bob    London
2  Charlie     Paris
3    David     Tokyo

## 8Ô∏è‚É£ Advanced Data Manipulation (merge, join, concat)
**Q1.** Merge two DataFrames ‚Äî `df1(ID, Name)` and `df2(ID, Score)` on the `'ID'` column.

In [1]:
# answer here
import pandas as pd
df1 = pd.DataFrame({
    'ID': [1, 2, 3, 4],
    'Name': ['Alice', 'Bob', 'Charlie', 'David']
})

df2 = pd.DataFrame({
    'ID': [1, 2, 3, 4],
    'Score': [85, 90, 88, 92]
})

merged_df = pd.merge(df1, df2, on='ID')
print(merged_df)

   ID     Name  Score
0   1    Alice     85
1   2      Bob     90
2   3  Charlie     88
3   4    David     92

**Q2.** Concatenate two DataFrames vertically using `pd.concat()`.

In [2]:
# answer here
import pandas as pd
df1 = pd.DataFrame({
    'ID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie']
})

df2 = pd.DataFrame({
    'ID': [4, 5, 6],
    'Name': ['David', 'Emma', 'Frank']
})

result = pd.concat([df1, df2])
print(result)

   ID     Name
0   1    Alice
1   2      Bob
2   3  Charlie
0   4    David
1   5     Emma
2   6    Frank

## 9Ô∏è‚É£ GroupBy Operations and Aggregations
**Q1.** Group sales data by `'City'` and find total sales.

In [3]:
# answer here
import pandas as pd
data = {
    'City': ['Delhi', 'Mumbai', 'Delhi', 'Pune', 'Mumbai', 'Pune'],
    'Sales': [20000, 25000, 30000, 15000, 18000, 12000]
}

df = pd.DataFrame(data)
total_sales = df.groupby('City')['Sales'].sum()

print(total_sales)

City
Delhi     50000
Mumbai    43000
Pune      27000
Name: Sales, dtype: int64

**Q2.** Find the average sales per city using `.mean()`.

In [4]:
# answer here
import pandas as pd
data = {
    'City': ['Delhi', 'Mumbai', 'Delhi', 'Pune', 'Mumbai', 'Pune'],
    'Sales': [20000, 25000, 30000, 15000, 18000, 12000]
}

df = pd.DataFrame(data)
average_sales = df.groupby('City')['Sales'].mean()

print(average_sales)

City
Delhi     25000.0
Mumbai    21500.0
Pune      13500.0
Name: Sales, dtype: float64

## üîü Pivot Tables (Excel-Style Operations)
**Q1.** Create a pivot table showing total sales by city using `pivot_table()`.

In [5]:
# answer here
import pandas as pd
data = {
    'City': ['Delhi', 'Mumbai', 'Delhi', 'Pune', 'Mumbai', 'Pune'],
    'Sales': [20000, 25000, 30000, 15000, 18000, 12000]
}

df = pd.DataFrame(data)
pivot = pd.pivot_table(df, index='City', values='Sales', aggfunc='sum')

print(pivot)

        Sales
City
Delhi   50000
Mumbai  43000
Pune    27000

**Q2.** Create a pivot table showing **average sales** by city.

In [6]:
# answer here
import pandas as pd
data = {
    'City': ['Delhi', 'Mumbai', 'Delhi', 'Pune', 'Mumbai', 'Pune'],
    'Sales': [20000, 25000, 30000, 15000, 18000, 12000]
}

df = pd.DataFrame(data)
pivot_avg = pd.pivot_table(df, index='City', values='Sales', aggfunc='mean')

print(pivot_avg)

          Sales
City
Delhi   25000.0
Mumbai  21500.0
Pune    13500.0

## 1Ô∏è‚É£1Ô∏è‚É£ Writing Data to Excel
**Q1.** Save a DataFrame named `sales` to an Excel file `sales_output.xlsx`.

In [7]:
# answer here
import pandas as pd
sales = pd.DataFrame({
    'City': ['Delhi', 'Mumbai', 'Pune'],
    'Sales': [50000, 43000, 27000]
})

sales.to_excel('sales_output.xlsx', index=False)

print("DataFrame has been saved to 'sales_output.xlsx'")

DataFrame has been saved to 'sales_output.xlsx'

**Q2.** Save multiple DataFrames to different sheets in the same Excel file using `ExcelWriter()`.

In [8]:
# answer here
import pandas as pd
sales_2024 = pd.DataFrame({
    'City': ['Delhi', 'Mumbai', 'Pune'],
    'Sales': [50000, 43000, 27000]
})

sales_2025 = pd.DataFrame({
    'City': ['Delhi', 'Mumbai', 'Pune'],
    'Sales': [55000, 47000, 30000]
})

with pd.ExcelWriter('sales_data.xlsx') as writer:
    sales_2024.to_excel(writer, sheet_name='Sales_2024', index=False)
    sales_2025.to_excel(writer, sheet_name='Sales_2025', index=False)

print("Both DataFrames saved to 'sales_data.xlsx' in separate sheets.")

Both DataFrames saved to 'sales_data.xlsx' in separate sheets.